Documents/РаспределениеЗатрат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>РаспределениеЗатрат</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Финансовый</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетЗатрат</Name>
					<Comment>(Фин)</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Финансовый</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МСФО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДоходовРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Распределение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТорговаяТочка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяДоходовРасходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДоходовРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦФО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Авторазмещение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособРаспределенияЗатрат</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыРаспределенияЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеРасхода</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Управление</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЭффективностьТорговыхТочек</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТорговаяТочка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Управление</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Эффективность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СтатьиРаспределенныеПоЭффективности</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяДоходовРасходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДоходовРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦФО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЦФОСтруктурныхЕдиниц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЦФОСтруктурныхЕдиниц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>АвторИзменений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменений</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыРозничныхТочек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ТипыРозничныхТочек</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Избенка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Магазин</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перекресток</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Микромаркет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пятерочка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПространствоВкуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вкусомат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тилси</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркетПлейс</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпособыРаспределенияЗатрат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СпособыРаспределенияЗатрат</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоВыручке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоКоличествуСмен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЭффективности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоВыручкеГруппыРазвития</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/РаспределениеЗатрат/Forms/ФормаРаспределенияВкусвиллОбщий/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МесяцОбработки = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(), -1));
	Месяц = Формат(МесяцОбработки, "ДФ='MMMM yyyy'");
	СчетЗатрат = ПланыСчетов.Финансовый.ЗатратыОбщиеДляРаспределения;
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	МесяцОбработки = НачалоМесяца(ДобавитьМесяц(МесяцОбработки, Направление));
	Месяц = Формат(МесяцОбработки, "ДФ='MMMM yyyy'");
	
КонецПроцедуры

&НаСервере
Функция ОпределитьЦФОДляТочки(Дата, ТТ, ТабСрез, ТабДвижения)
	
	ЦФО = Неопределено;
	МаксДата = '00010101';
	СтрокаСрез = ТабСрез.Найти(ТТ, "СтруктурнаяЕдиница");
	Если СтрокаСрез <> Неопределено Тогда
		ЦФО = СтрокаСрез.ЦФО;
	КонецЕсли;	
	
	СтрокиТТ = ТабДвижения.НайтиСтроки(Новый Структура("СтруктурнаяЕдиница", ТТ));
	Для Каждого СтрокаТТ Из СтрокиТТ Цикл
		Если СтрокаТТ.Период <= Дата
			И МаксДата <= СтрокаТТ.Период Тогда
			ЦФО = СтрокаТТ.ЦФО;
			МаксДата = СтрокаТТ.Период;
		КонецЕсли;	
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(ЦФО) Тогда
		Если СтрокиТТ.Количество() > 0 Тогда
			ЦФО = СтрокиТТ[0].ЦФО;
		КонецЕсли;	
	КонецЕсли;	
	
	Возврат ЦФО;
	
КонецФункции	

&НаСервере
Процедура ДораспределитьКопейки(ОстатокКРаспределению, МассивСтрок)
	
	ГСЧ = Новый ГенераторСлучайныхЧисел(Число(Формат(ТекущаяДата(), "ДФ=yyyymmss")));
	
	Пока ОстатокКРаспределению <> 0 Цикл
		СлучЧисло = ГСЧ.СлучайноеЧисло(0, МассивСтрок.Количество() - 1);
		СуммаИтерации = 0.01 * ?(ОстатокКРаспределению < 0, -1, 1);
		МассивСтрок[СлучЧисло].Сумма = МассивСтрок[СлучЧисло].Сумма + СуммаИтерации;
		ОстатокКРаспределению = ОстатокКРаспределению - СуммаИтерации;
	КонецЦикла;	
	
КонецПроцедуры	

&НаСервере
Процедура СоздатьДокументыЗатрат()
	
	СвойствоРаспределение = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("Счет распределения Вкусвилл (общий)");
	Если СвойствоРаспределение.Пустая() Тогда
		СвойствоРаспределениеОб = ПланыВидовХарактеристик.СвойстваОбъектов.СоздатьЭлемент();
		СвойствоРаспределениеОб.Наименование = "Счет распределения Вкусвилл (общий)";
		СвойствоРаспределениеОб.ТипЗначения = Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(50));
		СвойствоРаспределениеОб.Записать();
		СвойствоРаспределение = СвойствоРаспределениеОб.Ссылка;
	КонецЕсли;
	
	ЗапросПредДоков = Новый Запрос();
	ЗапросПредДоков.Текст = "ВЫБРАТЬ
	                        |	Операция.Ссылка
	                        |ИЗ
	                        |	Документ.Операция КАК Операция
	                        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	                        |		ПО Операция.Ссылка = ЗначенияСвойствОбъектов.Объект
	                        |ГДЕ
	                        |	Операция.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	                        |	И Операция.ПометкаУдаления = ЛОЖЬ
	                        |	И ЗначенияСвойствОбъектов.Значение = &Значение
	                        |	И ЗначенияСвойствОбъектов.Свойство = &Свойство";
							
	ЗапросПредДоков.УстановитьПараметр("Свойство", СвойствоРаспределение);
	ЗапросПредДоков.УстановитьПараметр("Значение", Строка(СчетЗатрат.УникальныйИдентификатор()));
	ЗапросПредДоков.УстановитьПараметр("ДатаНачала"		, НачалоМесяца(МесяцОбработки));
	ЗапросПредДоков.УстановитьПараметр("ДатаОкончания"	, КонецМесяца(МесяцОбработки));
	ТабДоков = ЗапросПредДоков.Выполнить().Выгрузить();
	Для Каждого СтрокаДок Из ТабДоков Цикл
		ДокОбъект = СтрокаДок.Ссылка.ПолучитьОбъект();
		ДокОбъект.Движения.Финансовый.Очистить();
		ДокОбъект.Записать();
	КонецЦикла;	
	
	СписокСчетов = Новый СписокЗначений;
	СписокСчетов.Добавить(ПланыСчетов.Финансовый.ЗатратыТорговыхТочек);
	СписокСчетов.Добавить(ПланыСчетов.Финансовый.ВыручкаТорговыхТочек);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала"		, НачалоМесяца(МесяцОбработки));
	Запрос.УстановитьПараметр("ДатаОкончания"	, КонецМесяца(МесяцОбработки));
	Запрос.УстановитьПараметр("СчетЗатрат"		, СчетЗатрат);
	Запрос.УстановитьПараметр("СписокСчетов"	, СписокСчетов);
	Запрос.УстановитьПараметр("Суб"	, Справочники.СтруктурныеЕдиницы.НайтиПоНаименованию("Вкусвилл (общий)", Истина));
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ФинансовыйОбороты.Субконто1 КАК ТорговаяТочка,
	               |	СУММА(ФинансовыйОбороты.СуммаОборотКт - ФинансовыйОбороты.СуммаОборотДт) КАК Выручка
	               |ИЗ
	               |	РегистрБухгалтерии.Финансовый.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, Счет В (&СписокСчетов), , Субконто2 = ЗНАЧЕНИЕ(Справочник.СтатьиДоходовРасходов.РозничнаяВыручка), , ) КАК ФинансовыйОбороты
	               |ГДЕ
	               |	ФинансовыйОбороты.Регистратор ССЫЛКА Документ.ЛистУчета
	               |	И ФинансовыйОбороты.Субконто1.ТипРозничнойТочки = ЗНАЧЕНИЕ(Перечисление.ТипыРозничныхТочек.Магазин)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ФинансовыйОбороты.Субконто1
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЛистУчета.ТорговаяТочка,
	               |	СУММА(1) КАК КолвоДней
	               |ИЗ
	               |	Документ.ЛистУчета КАК ЛистУчета
	               |ГДЕ
	               |	ЛистУчета.Проведен = ИСТИНА
	               |	И ЛистУчета.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	               |	И ЛистУчета.ТорговаяТочка.ТипРозничнойТочки = ЗНАЧЕНИЕ(Перечисление.ТипыРозничныхТочек.Магазин)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛистУчета.ТорговаяТочка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ФинансовыйОбороты.Субконто1 КАК ТорговаяТочка,
	               |	ФинансовыйОбороты.Субконто2 КАК СДР,
	               |	ФинансовыйОбороты.Субконто2.СпособРаспределенияЗатрат КАК СпособРаспределенияЗатрат,
	               |	ФинансовыйОбороты.Субконто3 КАК ЦФО,
	               |	ФинансовыйОбороты.СуммаОборот КАК СуммаОборот,
	               |	ФинансовыйОбороты.Организация,
	               |	ФинансовыйОбороты.СтруктурнаяЕдиница,
	               |	ФинансовыйОбороты.Период КАК Период
	               |ИЗ
	               |	РегистрБухгалтерии.Финансовый.Обороты(&ДатаНачала, &ДатаОкончания, День, Счет = &СчетЗатрат, , Субконто1 = &Суб, , ) КАК ФинансовыйОбороты
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЦФОСтруктурныхЕдиницСрезПоследних.СтруктурнаяЕдиница,
	               |	ЦФОСтруктурныхЕдиницСрезПоследних.ЦФО
	               |ИЗ
	               |	РегистрСведений.ЦФОСтруктурныхЕдиниц.СрезПоследних(&ДатаНачала, СтруктурнаяЕдиница.ТипРозничнойТочки = ЗНАЧЕНИЕ(Перечисление.ТипыРозничныхТочек.Магазин)) КАК ЦФОСтруктурныхЕдиницСрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЦФОСтруктурныхЕдиниц.Период,
	               |	ЦФОСтруктурныхЕдиниц.СтруктурнаяЕдиница,
	               |	ЦФОСтруктурныхЕдиниц.ЦФО
	               |ИЗ
	               |	РегистрСведений.ЦФОСтруктурныхЕдиниц КАК ЦФОСтруктурныхЕдиниц
	               |ГДЕ
	               |	ЦФОСтруктурныхЕдиниц.СтруктурнаяЕдиница.ТипРозничнойТочки = ЗНАЧЕНИЕ(Перечисление.ТипыРозничныхТочек.Магазин)
	               |	И ЦФОСтруктурныхЕдиниц.Период МЕЖДУ &ДатаНачала И &ДатаОкончания";
				   
	Результаты = Запрос.ВыполнитьПакет();
	
	ТабВыручка = Результаты[0].Выгрузить();
	ТабСмены = Результаты[1].Выгрузить();
	ТабСрез = Результаты[3].Выгрузить();
	ТабСрез.Индексы.Добавить("СтруктурнаяЕдиница");
	ТабДвижения = Результаты[4].Выгрузить();
	ТабДвижения.Индексы.Добавить("СтруктурнаяЕдиница");
	
	ТабВыручка.Колонки.Добавить("Процент");
	ТабСмены.Колонки.Добавить("Процент");
	
	ОбщаяСуммаВыручки = ТабВыручка.Итог("Выручка");
	ОбщаяСуммаДней = ТабСмены.Итог("КолвоДней");
	
	Для Каждого СтрокаТаб Из ТабВыручка Цикл
		Если СтрокаТаб.Выручка = 0 Тогда
			СтрокаТаб.Процент = 0;
		Иначе
			СтрокаТаб.Процент = СтрокаТаб.Выручка / ОбщаяСуммаВыручки;
		КонецЕсли;	
	КонецЦикла;
	
	Для Каждого СтрокаТаб Из ТабСмены Цикл
		Если СтрокаТаб.КолвоДней = 0 Тогда
			СтрокаТаб.Процент = 0;
		Иначе
			СтрокаТаб.Процент = СтрокаТаб.КолвоДней / ОбщаяСуммаДней;
		КонецЕсли;	
	КонецЦикла;
	
	Если ТабДоков.Количество() = 0 Тогда
		ДокОперация = Документы.Операция.СоздатьДокумент();
		ДокОперация.Дата = КонецМесяца(МесяцОбработки);
		ДокОперация.Комментарий = "Распределение затрат перед закрытием месяца по Вкусвилл (общий)";
	Иначе
		ДокОперация = ТабДоков[0].Ссылка.ПолучитьОбъект();
	КонецЕсли;	
	
	ТаблицаРаспределение = Новый ТаблицаЗначений();
	ТаблицаРаспределение.Колонки.Добавить("Организация");
	ТаблицаРаспределение.Колонки.Добавить("СтруктурнаяЕдиница");
	ТаблицаРаспределение.Колонки.Добавить("ТорговаяТочка");
	ТаблицаРаспределение.Колонки.Добавить("СДР");
	ТаблицаРаспределение.Колонки.Добавить("ЦФО");
	ТаблицаРаспределение.Колонки.Добавить("Субконто1");
	ТаблицаРаспределение.Колонки.Добавить("Субконто2");
	ТаблицаРаспределение.Колонки.Добавить("Субконто3");
	ТаблицаРаспределение.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	
	Выборка = Результаты[2].Выбрать();
	Пока Выборка.Следующий() Цикл
		СуммаКРаспределению = Выборка.СуммаОборот;
		Если СуммаКРаспределению = 0 Тогда
			Продолжить;
		КонецЕсли;
		МассивДобавленных = Новый Массив();
		СуммаРаспределено = 0;
		Если Выборка.СпособРаспределенияЗатрат = Перечисления.СпособыРаспределенияЗатрат.ПоВыручке
			ИЛИ НЕ ЗначениеЗаполнено(Выборка.СпособРаспределенияЗатрат) Тогда
			Для Каждого СтрокаВыручка Из ТабВыручка Цикл
				ЦФО = ОпределитьЦФОДляТочки(Выборка.Период, СтрокаВыручка.ТорговаяТочка, ТабСрез, ТабДвижения);
				Если НЕ ЗначениеЗаполнено(ЦФО) Тогда
					Продолжить;
				КонецЕсли;	
				СтрокаДоб = ТаблицаРаспределение.Добавить();
				СтрокаДоб.Организация = Выборка.Организация;
				СтрокаДоб.СтруктурнаяЕдиница = Выборка.СтруктурнаяЕдиница;
				СтрокаДоб.ТорговаяТочка = Выборка.ТорговаяТочка;
				СтрокаДоб.СДР = Выборка.СДР;
				СтрокаДоб.ЦФО = Выборка.ЦФО;
				СтрокаДоб.Субконто1 = СтрокаВыручка.ТорговаяТочка;
				СтрокаДоб.Субконто2 = Выборка.СДР;
				СтрокаДоб.Субконто3 = ЦФО;
				СтрокаДоб.Сумма = СуммаКРаспределению * СтрокаВыручка.Процент;
				СуммаРаспределено = СуммаРаспределено + СтрокаДоб.Сумма;
				МассивДобавленных.Добавить(СтрокаДоб);
			КонецЦикла;	
			Если СуммаРаспределено <> СуммаКРаспределению Тогда
				ДораспределитьКопейки(СуммаКРаспределению - СуммаРаспределено, МассивДобавленных);
			КонецЕсли;
		ИначеЕсли Выборка.СпособРаспределенияЗатрат = Перечисления.СпособыРаспределенияЗатрат.ПоКоличествуСмен Тогда
			Для Каждого СтрокаВыручка Из ТабСмены Цикл
				ЦФО = ОпределитьЦФОДляТочки(Выборка.Период, СтрокаВыручка.ТорговаяТочка, ТабСрез, ТабДвижения);
				Если НЕ ЗначениеЗаполнено(ЦФО) Тогда
					Продолжить;
				КонецЕсли;
				СтрокаДоб = ТаблицаРаспределение.Добавить();
				СтрокаДоб.Организация = Выборка.Организация;
				СтрокаДоб.СтруктурнаяЕдиница = Выборка.СтруктурнаяЕдиница;
				СтрокаДоб.ТорговаяТочка = Выборка.ТорговаяТочка;
				СтрокаДоб.СДР = Выборка.СДР;
				СтрокаДоб.ЦФО = Выборка.ЦФО;
				СтрокаДоб.Субконто1 = СтрокаВыручка.ТорговаяТочка;
				СтрокаДоб.Субконто2 = Выборка.СДР;
				СтрокаДоб.Субконто3 = ЦФО;
				СтрокаДоб.Сумма = СуммаКРаспределению * СтрокаВыручка.Процент;
				СуммаРаспределено = СуммаРаспределено + СтрокаДоб.Сумма;
				МассивДобавленных.Добавить(СтрокаДоб);
			КонецЦикла;	
			Если СуммаРаспределено <> СуммаКРаспределению Тогда
				ДораспределитьКопейки(СуммаКРаспределению - СуммаРаспределено, МассивДобавленных);
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;	
	
	ТаблицаРаспределение.Свернуть("Организация, СтруктурнаяЕдиница, ТорговаяТочка, СДР, ЦФО, Субконто1, Субконто2, Субконто3", "Сумма");
	
	СуммаОперации = 0;
	Для Каждого СтрокаРаспределение Из ТаблицаРаспределение Цикл
		Проводка = ДокОперация.Движения.Финансовый.Добавить();
		Проводка.Период										= КонецМесяца(МесяцОбработки);
		Проводка.Организация								= СтрокаРаспределение.Организация;
		Проводка.СтруктурнаяЕдиница							= СтрокаРаспределение.ТорговаяТочка;
		
		Проводка.СчетДт 									= СчетЗатрат;
		Проводка.СубконтоДт.ТорговыеТочки 					= СтрокаРаспределение.Субконто1;
		Проводка.СубконтоДт.СтатьиДоходовРасходов			= СтрокаРаспределение.Субконто2;
		Проводка.СубконтоДт.ЦФО								= СтрокаРаспределение.Субконто3;
		
		Проводка.СчетКт 									= СчетЗатрат;
		Проводка.СубконтоКт.ТорговыеТочки 					= СтрокаРаспределение.ТорговаяТочка;
		Проводка.СубконтоКт.СтатьиДоходовРасходов			= СтрокаРаспределение.СДР;
		//Проводка.СубконтоКт.ЦФО								= СтрокаРаспределение.ЦФО;
		Проводка.СубконтоКт.ЦФО								= СтрокаРаспределение.Субконто3;
		Проводка.Сумма 										= СтрокаРаспределение.Сумма;
		СуммаОперации = СуммаОперации + Проводка.Сумма;
	КонецЦикла;	
	
	ДокОперация.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	ДокОперация.СуммаОперации = СуммаОперации;
	ДокОперация.Записать();
	
	ЗаписьСвойств = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
	ЗаписьСвойств.Объект = ДокОперация.Ссылка;
	ЗаписьСвойств.Свойство = СвойствоРаспределение;
	ЗаписьСвойств.Значение = Строка(СчетЗатрат.УникальныйИдентификатор());
	ЗаписьСвойств.Записать();
	
КонецПроцедуры	

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	
	Отказ = Ложь;
	Если НЕ ЗначениеЗаполнено(МесяцОбработки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан месяц обработки",,,, Отказ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СчетЗатрат) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан счет затрат",,,, Отказ);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
	
	СоздатьДокументыЗатрат();
	
КонецПроцедуры
